// 常用字(2500字)
// 笔画顺序表
// @see http://www.china-language.gov.cn/wenziguifan/shanghi/013c.htm
module.exports = [

  // 一画
  "一乙",

  // 二画
  "二十丁厂七卜人入八九几儿了力乃刀又",

  // 三画
  "三于干亏士工土才寸下大丈与万上小",
  "口巾山千乞川亿个勺久凡及夕丸么广",
  "亡门义之尸弓己已子卫也女飞刃习叉",
  "马乡",


  // 四画
  "丰王井开夫天无元专云扎艺木五支厅",
  "不太犬区历尤友匹车巨牙屯比互切瓦",
  "止少日中冈贝内水见午牛手毛气升长",
  "仁什片仆化仇币仍仅斤爪反介父从今",
  "凶分乏公仓月氏勿欠风丹匀乌凤勾文",
  "六方火为斗忆订计户认心尺引丑巴孔",
  "队办以允予劝双书幻",

  // 五画
  "玉刊示末未击打巧正扑扒功扔去甘世",
  "古节本术可丙左厉右石布龙平灭轧东",
  "卡北占业旧帅归且旦目叶甲申叮电号",
  "田由史只央兄叼叫另叨叹四生失禾丘",
  "付仗代仙们仪白仔他斥瓜乎丛令用甩",
  "印乐句匆册犯外处冬鸟务包饥主市立",
  "闪兰半汁汇头汉宁穴它讨写让礼训必",
  "议讯记永司尼民出辽奶奴加召皮边发",
  "孕圣对台矛纠母幼丝",

  // 六画
  "式刑动扛寺吉扣考托老执巩圾扩扫地",
  "扬场耳共芒亚芝朽朴机权过臣再协西",
  "压厌在有百存而页匠夸夺灰达列死成",
  "夹轨邪划迈毕至此贞师尘尖劣光当早",
  "吐吓虫曲团同吊吃因吸吗屿帆岁回岂",
  "刚则肉网年朱先丢舌竹迁乔伟传乒乓",
  "休伍伏优伐延件任伤价份华仰仿伙伪",
  "自血向似后行舟全会杀合兆企众爷伞",
  "创肌朵杂危旬旨负各名多争色壮冲冰",
  "庄庆亦刘齐交次衣产决充妄闭问闯羊",
  "并关米灯州汗污江池汤忙兴宇守宅字",
  "安讲军许论农讽设访寻那迅尽导异孙",
  "阵阳收阶阴防奸如妇好她妈戏羽观欢",
  "买红纤级约纪驰巡",

  // 七画
  "寿弄麦形进戒吞远违运扶抚坛技坏扰",
  "拒找批扯址走抄坝贡攻赤折抓扮抢孝",
  "均抛投坟抗坑坊抖护壳志扭块声把报",
  "却劫芽花芹芬苍芳严芦劳克苏杆杠杜",
  "材村杏极李杨求更束豆两丽医辰励否",
  "还歼来连步坚旱盯呈时吴助县里呆园",
  "旷围呀吨足邮男困吵串员听吩吹呜吧",
  "吼别岗帐财针钉告我乱利秃秀私每兵",
  "估体何但伸作伯伶佣低你住位伴身皂",
  "佛近彻役返余希坐谷妥含邻岔肝肚肠",
  "龟免狂犹角删条卵岛迎饭饮系言冻状",
  "亩况床库疗应冷这序辛弃冶忘闲间闷",
  "判灶灿弟汪沙汽沃泛沟没沈沉怀忧快",
  "完宋宏牢究穷灾良证启评补初社识诉",
  "诊词译君灵即层尿尾迟局改张忌际陆",
  "阿陈阻附妙妖妨努忍劲鸡驱纯纱纳纲",
  "驳纵纷纸纹纺驴纽",

  // 八画
  "奉玩环武青责现表规抹拢拔拣担坦押",
  "抽拐拖拍者顶拆拥抵拘势抱垃拉拦拌",
  "幸招坡披拨择抬其取苦若茂苹苗英范",
  "直茄茎茅林枝杯柜析板松枪构杰述枕",
  "丧或画卧事刺枣雨卖矿码厕奔奇奋态",
  "欧垄妻轰顷转斩轮软到非叔肯齿些虎",
  "虏肾贤尚旺具果味昆国昌畅明易昂典",
  "固忠咐呼鸣咏呢岸岩帖罗帜岭凯败贩",
  "购图钓制知垂牧物乖刮秆和季委佳侍",
  "供使例版侄侦侧凭侨佩货依的迫质欣",
  "征往爬彼径所舍金命斧爸采受乳贪念",
  "贫肤肺肢肿胀朋股肥服胁周昏鱼兔狐",
  "忽狗备饰饱饲变京享店夜庙府底剂郊",
  "废净盲放刻育闸闹郑券卷单炒炊炕炎",
  "炉沫浅法泄河沾泪油泊沿泡注泻泳泥",
  "沸波泼泽治怖性怕怜怪学宝宗定宜审",
  "宙官空帘实试郎诗肩房诚衬衫视话诞",
  "询该详建肃录隶居届刷屈弦承孟孤陕",
  "降限妹姑姐姓始驾参艰线练组细驶织",
  "终驻驼绍经贯",

  // 九画
  "奏春帮珍玻毒型挂封持项垮挎城挠政",
  "赴赵挡挺括拴拾挑指垫挣挤拼挖按挥",
  "挪某甚革荐巷带草茧茶荒茫荡荣故胡",
  "南药标枯柄栋相查柏柳柱柿栏树要咸",
  "威歪研砖厘厚砌砍面耐耍牵残殃轻鸦",
  "皆背战点临览竖省削尝是盼眨哄显哑",
  "冒映星昨畏趴胃贵界虹虾蚁思蚂虽品",
  "咽骂哗咱响哈咬咳哪炭峡罚贱贴骨钞",
  "钟钢钥钩卸缸拜看矩怎牲选适秒香种",
  "秋科重复竿段便俩贷顺修保促侮俭俗",
  "俘信皇泉鬼侵追俊盾待律很须叙剑逃",
  "食盆胆胜胞胖脉勉狭狮独狡狱狠贸怨",
  "急饶蚀饺饼弯将奖哀亭亮度迹庭疮疯",
  "疫疤姿亲音帝施闻阀阁差养美姜叛送",
  "类迷前首逆总炼炸炮烂剃洁洪洒浇浊",
  "洞测洗活派洽染济洋洲浑浓津恒恢恰",
  "恼恨举觉宣室宫宪突穿窃客冠语扁袄",
  "祖神祝误诱说诵垦退既屋昼费陡眉孩",
  "除险院娃姥姨姻娇怒架贺盈勇怠柔垒",
  "绑绒结绕骄绘给络骆绝绞统",

  // 十画
  "耕耗艳泰珠班素蚕顽盏匪捞栽捕振载",
  "赶起盐捎捏埋捉捆捐损都哲逝捡换挽",
  "热恐壶挨耻耽恭莲莫荷获晋恶真框桂",
  "档桐株桥桃格校核样根索哥速逗栗配",
  "翅辱唇夏础破原套逐烈殊顾轿较顿毙",
  "致柴桌虑监紧党晒眠晓鸭晃晌晕蚊哨",
  "哭恩唤啊唉罢峰圆贼贿钱钳钻铁铃铅",
  "缺氧特牺造乘敌秤租积秧秩称秘透笔",
  "笑笋债借值倚倾倒倘俱倡候俯倍倦健",
  "臭射躬息徒徐舰舱般航途拿爹爱颂翁",
  "脆脂胸胳脏胶脑狸狼逢留皱饿恋桨浆",
  "衰高席准座脊症病疾疼疲效离唐资凉",
  "站剖竞部旁旅畜阅羞瓶拳粉料益兼烤",
  "烘烦烧烛烟递涛浙涝酒涉消浩海涂浴",
  "浮流润浪浸涨烫涌悟悄悔悦害宽家宵",
  "宴宾窄容宰案请朗诸读扇袜袖袍被祥",
  "课谁调冤谅谈谊剥恳展剧屑弱陵陶陷",
  "陪娱娘通能难预桑绢绣验继",

  // 十一画
  "球理捧堵描域掩捷排掉堆推掀授教掏",
  "掠培接控探据掘职基著勒黄萌萝菌菜",
  "萄菊萍菠营械梦梢梅检梳梯桶救副票",
  "戚爽聋袭盛雪辅辆虚雀堂常匙晨睁眯",
  "眼悬野啦晚啄距跃略蛇累唱患唯崖崭",
  "崇圈铜铲银甜梨犁移笨笼笛符第敏做",
  "袋悠偿偶偷您售停偏假得衔盘船斜盒",
  "鸽悉欲彩领脚脖脸脱象够猜猪猎猫猛",
  "馅馆凑减毫麻痒痕廊康庸鹿盗章竟商",
  "族旋望率着盖粘粗粒断剪兽清添淋淹",
  "渠渐混渔淘液淡深婆梁渗情惜惭悼惧",
  "惕惊惨惯寇寄宿窑密谋谎祸谜逮敢屠",
  "弹随蛋隆隐婚婶颈绩绪续骑绳维绵绸",
  "绿",

  // 十二画
  "琴斑替款堪搭塔越趁趋超提堤博揭喜",
  "插揪搜煮援裁搁搂搅握揉斯期欺联散",
  "惹葬葛董葡敬葱落朝辜葵棒棋植森椅",
  "椒棵棍棉棚棕惠惑逼厨厦硬确雁殖裂",
  "雄暂雅辈悲紫辉敞赏掌晴暑最量喷晶",
  "喇遇喊景践跌跑遗蛙蛛蜓喝喂喘喉幅",
  "帽赌赔黑铸铺链销锁锄锅锈锋锐短智",
  "毯鹅剩稍程稀税筐等筑策筛筒答筋筝",
  "傲傅牌堡集焦傍储奥街惩御循艇舒番",
  "释禽腊脾腔鲁猾猴然馋装蛮就痛童阔",
  "善羡普粪尊道曾焰港湖渣湿温渴滑湾",
  "渡游滋溉愤慌惰愧愉慨割寒富窜窝窗",
  "遍裕裤裙谢谣谦属屡强粥疏隔隙絮嫂",
  "登缎缓编骗缘",

  // 十三画
  "瑞魂肆摄摸填搏塌鼓摆携搬摇搞塘摊",
  "蒜勤鹊蓝墓幕蓬蓄蒙蒸献禁楚想槐榆",
  "楼概赖酬感碍碑碎碰碗碌雷零雾雹输",
  "督龄鉴睛睡睬鄙愚暖盟歇暗照跨跳跪",
  "路跟遣蛾蜂嗓置罪罩错锡锣锤锦键锯",
  "矮辞稠愁筹签简毁舅鼠催傻像躲微愈",
  "遥腰腥腹腾腿触解酱痰廉新韵意粮数",
  "煎塑慈煤煌满漠源滤滥滔溪溜滚滨粱",
  "滩慎誉塞谨福群殿辟障嫌嫁叠缝缠",

  // 十四画
  "静碧璃墙撇嘉摧截誓境摘摔聚蔽慕暮",
  "蔑模榴榜榨歌遭酷酿酸磁愿需弊裳颗",
  "嗽蜻蜡蝇蜘赚锹锻舞稳算箩管僚鼻魄",
  "貌膜膊膀鲜疑馒裹敲豪膏遮腐瘦辣竭",
  "端旗精歉熄熔漆漂漫滴演漏慢寨赛察",
  "蜜谱嫩翠熊凳骡缩",

  // 十五画
  "慧撕撒趣趟撑播撞撤增聪鞋蕉蔬横槽",
  "樱橡飘醋醉震霉瞒题暴瞎影踢踏踩踪",
  "蝶蝴嘱墨镇靠稻黎稿稼箱箭篇僵躺僻",
  "德艘膝膛熟摩颜毅糊遵潜潮懂额慰劈",

  // 十六画
  "操燕薯薪薄颠橘整融醒餐嘴蹄器赠默",
  "镜赞篮邀衡膨雕磨凝辨辩糖糕燃澡激",
  "懒壁避缴",

  // 十七画
  "戴擦鞠藏霜霞瞧蹈螺穗繁辫赢糟糠燥",
  "臂翼骤",

  // 十八画
  "鞭覆蹦镰翻鹰",

  // 十九画
  "警攀蹲颤瓣爆疆",

  // 二十画
  "壤耀躁嚼嚷籍魔灌",

  // 二十一画
  "蠢霸露",

  // 二十二画
  "囊",

  // 二十三画
  "罐"
].join("");
