// 次常用字(1000字)
// 笔画顺序表
// @see http://www.china-language.gov.cn/wenziguifan/shanghi/013d.htm
module.exports = [
  // 画
  "匕刁",

  // 画
  "丐歹戈夭仑讥冗邓",

  // 画
  "艾夯凸卢叭叽皿凹囚矢乍尔冯玄",

  // 画
  "邦迂邢芋芍吏夷吁吕吆屹廷迄臼仲伦",
  "伊肋旭匈凫妆亥汛讳讶讹讼诀弛阱驮",
  "驯纫",

  // 画
  "玖玛韧抠扼汞扳抡坎坞抑拟抒芙芜苇",
  "芥芯芭杖杉巫杈甫匣轩卤肖吱吠呕呐",
  "吟呛吻吭邑囤吮岖牡佑佃伺囱肛肘甸",
  "狈鸠彤灸刨庇吝庐闰兑灼沐沛汰沥沦",
  "汹沧沪忱诅诈罕屁坠妓姊妒纬",

  // 画
  "玫卦坷坯拓坪坤拄拧拂拙拇拗茉昔苛",
  "苫苟苞茁苔枉枢枚枫杭郁矾奈奄殴歧",
  "卓昙哎咕呵咙呻咒咆咖帕账贬贮氛秉",
  "岳侠侥侣侈卑刽刹肴觅忿瓮肮肪狞庞",
  "疟疙疚卒氓炬沽沮泣泞泌沼怔怯宠宛",
  "衩祈诡帚屉弧弥陋陌函姆虱叁绅驹绊",
  "绎",

  // 画
  "契贰玷玲珊拭拷拱挟垢垛拯荆茸茬荚",
  "茵茴荞荠荤荧荔栈柑栅柠枷勃柬砂泵",
  "砚鸥轴韭虐昧盹咧昵昭盅勋哆咪哟幽",
  "钙钝钠钦钧钮毡氢秕俏俄俐侯徊衍胚",
  "胧胎狰饵峦奕咨飒闺闽籽娄烁炫洼柒",
  "涎洛恃恍恬恤宦诫诬祠诲屏屎逊陨姚",
  "娜蚤骇",

  // 画
  "耘耙秦匿埂捂捍袁捌挫挚捣捅埃耿聂",
  "荸莽莱莉莹莺梆栖桦栓桅桩贾酌砸砰",
  "砾殉逞哮唠哺剔蚌蚜畔蚣蚪蚓哩圃鸯",
  "唁哼唆峭唧峻赂赃钾铆氨秫笆俺赁倔",
  "殷耸舀豺豹颁胯胰脐脓逛卿鸵鸳馁凌",
  "凄衷郭斋疹紊瓷羔烙浦涡涣涤涧涕涩",
  "悍悯窍诺诽袒谆祟恕娩骏",

  // 一画
  "琐麸琉琅措捺捶赦埠捻掐掂掖掷掸掺",
  "勘聊娶菱菲萎菩萤乾萧萨菇彬梗梧梭",
  "曹酝酗厢硅硕奢盔匾颅彪眶晤曼晦冕",
  "啡畦趾啃蛆蚯蛉蛀唬啰唾啤啥啸崎逻",
  "崔崩婴赊铐铛铝铡铣铭矫秸秽笙笤偎",
  "傀躯兜衅徘徙舶舷舵敛翎脯逸凰猖祭",
  "烹庶庵痊阎阐眷焊焕鸿涯淑淌淮淆渊",
  "淫淳淤淀涮涵惦悴惋寂窒谍谐裆袱祷",
  "谒谓谚尉堕隅婉颇绰绷综绽缀巢",

  // 二画
  "琳琢琼揍堰揩揽揖彭揣搀搓壹搔葫募",
  "蒋蒂韩棱椰焚椎棺榔椭粟棘酣酥硝硫",
  "颊雳翘凿棠晰鼎喳遏晾畴跋跛蛔蜒蛤",
  "鹃喻啼喧嵌赋赎赐锉锌甥掰氮氯黍筏",
  "牍粤逾腌腋腕猩猬惫敦痘痢痪竣翔奠",
  "遂焙滞湘渤渺溃溅湃愕惶寓窖窘雇谤",
  "犀隘媒媚婿缅缆缔缕骚",

  // 三画
  "瑟鹉瑰搪聘斟靴靶蓖蒿蒲蓉楔椿楷榄",
  "楞楣酪碘硼碉辐辑频睹睦瞄嗜嗦暇畸",
  "跷跺蜈蜗蜕蛹嗅嗡嗤署蜀幌锚锥锨锭",
  "锰稚颓筷魁衙腻腮腺鹏肄猿颖煞雏馍",
  "馏禀痹廓痴靖誊漓溢溯溶滓溺寞窥窟",
  "寝褂裸谬媳嫉缚缤剿",

  // 四画
  "赘熬赫蔫摹蔓蔗蔼熙蔚兢榛榕酵碟碴",
  "碱碳辕辖雌墅嘁踊蝉嘀幔镀舔熏箍箕",
  "箫舆僧孵瘩瘟彰粹漱漩漾慷寡寥谭褐",
  "褪隧嫡缨",

  // 五画
  "撵撩撮撬擒墩撰鞍蕊蕴樊樟橄敷豌醇",
  "磕磅碾憋嘶嘲嘹蝠蝎蝌蝗蝙嘿幢镊镐",
  "稽篓膘鲤鲫褒瘪瘤瘫凛澎潭潦澳潘澈",
  "澜澄憔懊憎翩褥谴鹤憨履嬉豫缭",

  // 六画
  "撼擂擅蕾薛薇擎翰噩橱橙瓢蟥霍霎辙",
  "冀踱蹂蟆螃螟噪鹦黔穆篡篷篙篱儒膳",
  "鲸瘾瘸糙燎濒憾懈窿缰",

  // 七画
  "壕藐檬檐檩檀礁磷瞭瞬瞳瞪曙蹋蟋蟀",
  "嚎赡镣魏簇儡徽爵朦臊鳄糜癌懦豁臀",

  // 八画
  "藕藤瞻嚣鳍癞瀑襟璧戳",

  // 九画
  "攒孽蘑藻鳖蹭蹬簸簿蟹靡癣羹",

  // 十画
  "鬓攘蠕巍鳞糯譬",

  // 十一画
  "霹躏髓",

  // 十二画
  "蘸镶瓤",

  // 十四画
  "矗"
].join("");
